[
    {
        "clasificacion": "Preparation,Documentation, and Communication",
        "grupo": 48,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "What is the most important aspect of 'Ability to interpret and follow patient identification protocols'?",
        "image": "",
        "opciones": [
            "Memorizing the patient's room number.",
            "Verifying the patient's full name and date of birth against the order.",
            "Asking the patient what exam they think they are having.",
            "Checking the patient's dietary restrictions."
        ],
        "respuesta_correcta": [
            "Verifying the patient's full name and date of birth against the order."
        ],
        "concept_to_study": "Patient identification protocols.",
        "explicacion_openai": "Adhering to patient identification protocols, typically involving confirming at least two unique identifiers like full name and date of birth, is paramount to prevent medical errors and ensure patient safety. (Refer to ARDMS RVT content outline section 7.A.1).",
        "image_explanation": "No image provided. Question is text-based."
    },
    {
        "clasificacion": "Preparation,Documentation, and Communication",
        "grupo": 49,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "A patient is referred for a renal artery ultrasound due to uncontrolled hypertension. What 'Knowledge of appropriate indications' is key for the technologist?",
        "image": "",
        "opciones": [
            "Renal artery ultrasound is indicated for evaluation of kidney stones.",
            "Renal artery ultrasound is indicated for detection of renal artery stenosis as a cause of secondary hypertension.",
            "Renal artery ultrasound is primarily for prostate evaluation.",
            "Renal artery ultrasound is contraindicated in patients with hypertension."
        ],
        "respuesta_correcta": [
            "Renal artery ultrasound is indicated for detection of renal artery stenosis as a cause of secondary hypertension."
        ],
        "concept_to_study": "Indications for renal artery ultrasound.",
        "explicacion_openai": "Uncontrolled hypertension is a primary indication for renal artery ultrasound to evaluate for renal artery stenosis, which is a treatable cause of secondary hypertension. (Refer to Zwiebel, W. J., & Pellerito, J. S. (2005). Introduction to vascular ultrasonography.)",
        "image_explanation": "No image provided. Question is text-based."
    },
    {
        "clasificacion": "Preparation,Documentation, and Communication",
        "grupo": 50,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "When 'utilizing resources, such as physicians, literature, or peers', what is the most appropriate action for a technologist encountering an unusual vascular anomaly during an exam?",
        "image": "",
        "opciones": [
            "Conclude the exam without further investigation.",
            "Document the finding and consult with an experienced peer or interpreting physician for guidance.",
            "Tell the patient that they have a rare condition.",
            "Attempt to self-diagnose the anomaly based on a quick internet search."
        ],
        "respuesta_correcta": [
            "Document the finding and consult with an experienced peer or interpreting physician for guidance."
        ],
        "concept_to_study": "Utilizing resources, problem-solving, professional collaboration.",
        "explicacion_openai": "Encountering unusual findings requires professional judgment. Consulting with peers or the interpreting physician is a key resource for clarification, additional insight, and ensuring accurate documentation and reporting. (Refer to ARDMS RVT content outline section 7.B.1).",
        "image_explanation": "No image provided. Question is text-based."
    },
    {
        "clasificacion": "Preparation,Documentation, and Communication",
        "grupo": 51,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "A patient presents with sudden onset, severe, unilateral leg pain, pallor, and pulselessness. What 'Knowledge of signs and symptoms pertaining to the vascular exam' is critical here?",
        "image": "",
        "opciones": [
            "These are symptoms of a common muscle strain.",
            "These are classic '5 P' signs of acute arterial occlusion and require immediate attention.",
            "These symptoms suggest a venous insufficiency problem.",
            "These indicate a need for a carotid ultrasound."
        ],
        "respuesta_correcta": [
            "These are classic '5 P' signs of acute arterial occlusion and require immediate attention."
        ],
        "concept_to_study": "Signs and symptoms of acute arterial occlusion (5 Ps).",
        "explicacion_openai": "The '5 Ps' (Pain, Pallor, Pulselessness, Paresthesia, Paralysis) are classic signs of acute arterial occlusion, which is a vascular emergency requiring immediate diagnosis and intervention. Recognizing these is critical. (Refer to Zwiebel, W. J., & Pellerito, J. S. (2005). Introduction to vascular ultrasonography.)",
        "image_explanation": "No image provided. Question is text-based."
    },
    {
        "clasificacion": "Quality Assurance, Safety, and Physical Principles",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "An ultrasound image shows a duplicated structure deep to a strong reflector, with identical shape and echogenicity. What is the most likely explanation for this finding?",
        "image": "Mirror_artifact2.png",
        "opciones": [
            "Side lobe artifact",
            "Refraction artifact",
            "Beam width artifact",
            "Artifact caused by sound wave reflection off a strong interface"
        ],
        "respuesta_correcta": [
            "Artifact caused by sound wave reflection off a strong interface"
        ],
        "concept_to_study": "Identification of mirror artifact based on sonographic appearance",
        "explicacion_openai": "This question tests the ability to recognize a mirror artifact without naming it directly. Mirror artifacts occur when ultrasound waves reflect off a strong specular interface—such as the diaphragm, pleura, or bladder wall—and return to the transducer via an indirect path. The system assumes the echo traveled in a straight line, so it places the duplicated structure deeper than the original. The duplicated image often appears identical in shape and echogenicity, but lacks true anatomical continuity. Recognizing this pattern is essential to avoid misdiagnosing a duplicated organ or lesion.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Quality Assurance, Safety, and Physical Principles",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "Which of the following is the most effective method to eliminate the duplicated structure seen deep to a strong reflector?",
        "image": "Mirror_artifact2.png",
        "opciones": [
            "Increase overall gain",
            "Change the angle of insonation",
            "Use compound imaging",
            "Apply tissue harmonic imaging"
        ],
        "respuesta_correcta": [
            "Change the angle of insonation"
        ],
        "concept_to_study": "Technical adjustment to eliminate mirror artifact",
        "explicacion_openai": "Mirror artifacts are angle-dependent. They occur when the ultrasound beam strikes a strong reflector at a certain angle, causing the reflected wave to bounce back indirectly. By changing the angle of insonation—for example, tilting the transducer slightly—you alter the path of the reflected wave, which can prevent the artifact from forming. Increasing gain or using harmonic imaging may enhance or suppress other features, but they won’t reliably eliminate mirror artifacts. Compound imaging may help in some cases, but angle adjustment is the most direct and effective solution.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Quality Assurance, Safety, and Physical Principles",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "What physical principle explains the appearance of a duplicated structure deep to a strong reflector in ultrasound imaging?",
        "image": "Mirror_artifact2.png",
        "opciones": [
            "Misregistration due to reverberation between transducer and skin",
            "Sound wave reflection off a specular interface, returning to the transducer via an indirect path",
            "Refraction of sound waves at curved tissue boundaries",
            "Attenuation of sound waves in highly vascular tissue"
        ],
        "respuesta_correcta": [
            "Sound wave reflection off a specular interface, returning to the transducer via an indirect path"
        ],
        "concept_to_study": "Understanding the physical principles behind mirror artifact formation",
        "explicacion_openai": "Mirror artifacts are caused by indirect reflection of sound waves. When a wave hits a strong specular reflector—like the diaphragm—it can bounce off and reflect again before returning to the transducer. The ultrasound system assumes all echoes travel in straight lines, so it misplaces the delayed echo deeper than its true origin. This results in a duplicated image that mirrors the original structure. Unlike reverberation, which creates multiple linear echoes, mirror artifacts preserve the shape and echogenicity of the original structure but appear in an anatomically impossible location.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Physiologic Exams",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "The plethysmographic waveform in the image shows a sharp systolic peak followed by a prominent dicrotic wave. What is the most likely interpretation?",
        "image": "normal_PPG.png",
        "opciones": [
            "Normal arterial compliance and flow",
            "Mild arterial disease",
            "Moderate proximal obstruction",
            "Severe arterial occlusion"
        ],
        "respuesta_correcta": [
            "Normal arterial compliance and flow"
        ],
        "concept_to_study": "Recognition of normal plethysmographic waveform features",
        "explicacion_openai": "A normal plethysmographic waveform is characterized by a sharp systolic peak and a clear dicrotic wave, reflecting healthy arterial compliance and unobstructed blood flow. This indicates normal hemodynamic status without evidence of proximal obstruction.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Physiologic Exams",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "The waveform labeled “PLETHYSMOGRAPH” demonstrates a sharp systolic peak with a visible dicrotic notch. In which clinical scenario is this pattern most compatible?",
        "image": "normal_PPG.png",
        "opciones": [
            "A healthy adult with normal ankle-brachial index",
            "A patient with mild peripheral arterial disease",
            "A patient with moderate arterial obstruction",
            "A patient with acute arterial occlusion"
        ],
        "respuesta_correcta": [
            "A healthy adult with normal ankle-brachial index"
        ],
        "concept_to_study": "Clinical correlation of normal plethysmographic waveform",
        "explicacion_openai": "This waveform is typical of a normal physiologic state, where arterial elasticity and blood flow are preserved. The presence of a dicrotic notch indicates normal reflection of the pulse wave from peripheral resistance vessels. It is not consistent with mild, moderate, or severe arterial disease.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Physiologic Exams",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "The waveform shown in the image labeled “PLETHYSMOGRAPH” displays a sharp systolic peak without a dicrotic notch and a bowed downslope. In which of the following clinical scenarios is this waveform most likely to be observed?",
        "image": "mild_stenosis_PPG.png",
        "opciones": [
            "A healthy young adult with normal ankle-brachial index",
            "A patient with mild peripheral arterial disease and early atherosclerotic changes",
            "A patient with acute arterial occlusion and absent distal pulses",
            "A patient with chronic venous insufficiency and varicosities"
        ],
        "respuesta_correcta": [
            "A patient with mild peripheral arterial disease and early atherosclerotic changes"
        ],
        "concept_to_study": "Recognition of mildly abnormal plethysmographic waveform and its clinical correlation",
        "explicacion_openai": "The waveform in the image represents a mildly abnormal plethysmographic pattern, characterized by a sharp systolic peak and a bowed downslope, but lacking the dicrotic wave. This is typically seen in patients with early peripheral arterial disease, where arterial compliance begins to decline due to mild atherosclerosis.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Physiologic Exams",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "The plethysmographic waveform in the image shows a sharp systolic peak, absent dicrotic wave, and a bowed downslope. What is the most likely interpretation of this pattern?",
        "image": "mild_stenosis_PPG.png",
        "opciones": [
            "Normal waveform with high compliance",
            "Mild arterial abnormality",
            "Severe proximal obstruction",
            "Artifact due to patient movement"
        ],
        "respuesta_correcta": [
            "Mild arterial abnormality"
        ],
        "concept_to_study": "Interpretation of mildly abnormal plethysmographic waveform features",
        "explicacion_openai": "A mildly abnormal plethysmographic waveform retains a sharp systolic peak but lacks the dicrotic wave, and the downslope curves away from the baseline. This pattern suggests early changes in arterial compliance or mild flow disturbance, often without significant hemodynamic compromise.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Physiologic Exams",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "The plethysmographic waveform in the image shows a flattened systolic peak with nearly equal upslope and downslope times, and no dicrotic wave. What is the most likely interpretation?",
        "image": "Moderately_abnormal_plethys.png",
        "opciones": [
            "Normal arterial compliance",
            "Mild arterial abnormality",
            "Moderate proximal arterial disease",
            "Severe arterial occlusion"
        ],
        "respuesta_correcta": [
            "Moderate proximal arterial disease"
        ],
        "concept_to_study": "Recognition of moderately abnormal plethysmographic waveform and its diagnostic significance",
        "explicacion_openai": "A moderately abnormal plethysmographic waveform is characterized by a flattened systolic peak, equal upslope and downslope times, and absence of the dicrotic wave. This pattern reflects hemodynamically significant disease proximal to the recording site.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Physiologic Exams",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "The waveform in the image labeled “PLETHYSMOGRAPH” demonstrates decreased amplitude, flattened peak, and absent dicrotic wave. In which clinical scenario is this pattern most compatible?",
        "image": "Moderately_abnormal_plethys.png",
        "opciones": [
            "A patient with early venous reflux",
            "A patient with moderate peripheral arterial disease",
            "A healthy young adult with normal ABI",
            "A patient with acute arterial occlusion and absent pulses"
        ],
        "respuesta_correcta": [
            "A patient with moderate peripheral arterial disease"
        ],
        "concept_to_study": "Clinical correlation of moderately abnormal plethysmographic waveform",
        "explicacion_openai": "This waveform is typical of moderate peripheral arterial disease, where arterial compliance and flow velocity are reduced. Unlike mild disease, the peak is flattened and the dicrotic wave is absent.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Physiologic Exams",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "The plethysmographic waveform shows very low amplitude, no dicrotic wave, and equal upslope and downslope times. What is the most likely interpretation?",
        "image": "severely_abnormal_PPG.png",
        "opciones": [
            "Mild arterial disease",
            "Artifact due to patient movement",
            "Severe proximal arterial obstruction",
            "Normal waveform variant"
        ],
        "respuesta_correcta": [
            "Severe proximal arterial obstruction"
        ],
        "concept_to_study": "Recognition of severely abnormal plethysmographic waveform and its diagnostic significance",
        "explicacion_openai": "A severely abnormal waveform is characterized by absent or minimal amplitude, equal upslope and downslope times, and no dicrotic wave. This pattern reflects critical reduction in perfusion, typically due to severe proximal arterial obstruction.",
        "image_explanation": ""
    },
    {
        "clasificacion": "Physiologic Exams",
        "grupo": 173,
        "tipo_pregunta": "opcion_multiple",
        "enunciado": "The waveform shown in the image labeled “PLETHYSMOGRAPH” demonstrates absent dicrotic wave, very low amplitude, and equal rise and fall times. In which clinical scenario is this pattern most compatible?",
        "image": "severely_abnormal_PPG.png",
        "opciones": [
            "A patient with mild atherosclerosis and normal ABI",
            "A patient with acute arterial occlusion and absent distal pulses",
            "A patient with venous insufficiency and edema",
            "A healthy adult undergoing routine screening"
        ],
        "respuesta_correcta": [
            "A patient with acute arterial occlusion and absent distal pulses"
        ],
        "concept_to_study": "Clinical correlation of severely abnormal plethysmographic waveform",
        "explicacion_openai": "This waveform is typical of severe arterial compromise, such as acute occlusion, where distal perfusion is critically reduced. The absence of a dicrotic wave and minimal amplitude reflect near-complete flow obstruction.",
        "image_explanation": ""
    }
]
